# Вар 31
# Описать функцию SortInc3(А, В, С), меняющую содержимое переменных А, В, С таким
# образом, чтобы их значения оказались упорядоченными по
# возрастанию (А, B, C вещественные параметры, являющиеся одновременно входными и выходными).
# С помощью этой функции упорядочить по возрастанию два данных
# набора из трех чисел: (Аі, Ві, Сі) и (А2, В2, С2).
def sort1():
    a = A1, B1, C1 = int(input('Введите число "A1: ')), int(input('Введите число "B1: ')), int(input('Введите число "C1: '))
    b = Ai, Bi, Ci = int(input('Введите число "Ai: "')), int(input('Введите число "Bi: "')), int(input('Введите число "Ci: '))
    sortA = sorted(a)
    sortB = sorted(b)
    return(sortA, sortB)
print(sort1())



